{
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone_config": {
    "backbone": "resnet50",
    "dtype": "float32",
    "features_only": true,
    "freeze_batch_norm_2d": false,
    "model_type": "timm_backbone",
    "num_channels": 3,
    "out_features": [
      "layer1",
      "layer2",
      "layer3",
      "layer4"
    ],
    "out_indices": [
      1,
      2,
      3,
      4
    ],
    "output_stride": null,
    "stage_names": [
      "act1",
      "layer1",
      "layer2",
      "layer3",
      "layer4"
    ],
    "use_pretrained_backbone": false
  },
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "classifier_dropout": 0.0,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "dtype": "float32",
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "detr",
  "num_channels": 3,
  "num_queries": 100,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "transformers_version": "5.5.4"
}
